controllers/SiteController.php

    public function actionStorage()
    {

        $russiaArmoring = Meta::find()->where("meta_key='russia_armoring'")->one()->meta_value;
        $ussrArmoring = Meta::find()->where("meta_key='ussr_armoring'")->one()->meta_value;
        $olympiadArmoring = Meta::find()->where("meta_key='olympiad_armoring'")->one()->meta_value;

        $russiaNames = Things::find()->where("category='russia'")->all();
---
SELECT * FROM `meta` WHERE meta_key='russia_armoring'
SELECT * FROM `things` WHERE category='olympiad80'


        $editForm = new EditForm();
        if (($editForm->load(Yii::$app->request->post())) && ($editForm->validate())){
            $amountThings = Things::find()->all();
---
SELECT * FROM `things` WHERE category='olympiad80'

            $amountUssr = count(Things::find()->where("category='ussr'")->all());
            $amountOlympiad80 = count(Things::find()->where("category='olympiad80'")->all());

            Things::deleteAll();
---
DELETE FROM `things`

                $post->save();
                $article = $editForm->editArticle[$i];

                $wpPosts = WpPostmeta::find()->where("(meta_key='article') AND (meta_value='$article') ")->one();
---
SELECT * FROM `wp_postmeta` WHERE (meta_key='sizes') AND (post_id='275')